posts/Misc./My Thought and Practices on Getting Things Done (GTD).html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Thought and Practices on Getting Things Done (GTD)</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">My Thought and Practices on Getting Things Done (GTD)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org248c9a8">1. Goal</a></li>
<li><a href="#orge6d594b">2. My post on reddit</a></li>
<li><a href="#org060f2da">3. Milestone summary</a></li>
<li><a href="#org17efbff">4. Migration to Org mode as my GTD system</a></li>
<li><a href="#org46cb243">5. One month after migrating to Org-mode</a>
<ul>
<li><a href="#org7180ab5">5.1. Case study: How to see what I have doen last week?</a></li>
<li><a href="#orgc1baffe">5.2. Issues I met</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org248c9a8" class="outline-2">
<h2 id="org248c9a8"><span class="section-number-2">1</span> Goal</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Won't miss appointments without always keep them in mind.</li>
<li>Have enough time to complete tasks ahead of the deadlines.</li>
<li>Know what to do best at any time.</li>
</ul>
</div>
</div>
<div id="outline-container-orge6d594b" class="outline-2">
<h2 id="orge6d594b"><span class="section-number-2">2</span> My post on reddit</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/omnifocus/comments/bug4a3/omnifocus_is_for_task_management_not_for_time/?utm_source=share&amp;utm_medium=web2x">OmniFocus is for task management, NOT for time management?</a></li>
</ul>
</div>
</div>
<div id="outline-container-org060f2da" class="outline-2">
<h2 id="org060f2da"><span class="section-number-2">3</span> Milestone summary</h2>
<div class="outline-text-2" id="text-3">
<p>
The insight is separating task management and time management.
</p>

<p>
Task management deals with tasks, and aims at
</p>
<ul class="org-ul">
<li>recording tasks</li>
<li>setting deadlines, notifications</li>
<li>grouping task (maybe into multiple dimensions) for the convenience
of later scheduling</li>
<li>complex task involves project management methodology</li>
</ul>

<p>
Time management deals with time resource.  It schedules tasks into my
available time blocks to
</p>
<ul class="org-ul">
<li>Make sure that tasks are assigned proper time resource so that
<ol class="org-ol">
<li>They have enough time to finish.</li>
<li>Tasks that have different priority are treated differently.</li>
</ol></li>
<li>Balance tension and slack and maximize my efficiency</li>
</ul>

<p>
I use OmniFocus and OmniPlan for task management and Apple Calendar
for time management.
</p>
</div>
</div>
<div id="outline-container-org17efbff" class="outline-2">
<h2 id="org17efbff"><span class="section-number-2">4</span> Migration to Org mode as my GTD system</h2>
<div class="outline-text-2" id="text-4">
<p>
Principles:
</p>
<ol class="org-ol">
<li>Make common things faster.</li>
<li>Python philosophy: make it simple and intuitive.</li>
</ol>

<p>
Primitives:
</p>
<ol class="org-ol">
<li>Sub-trees.
<ol class="org-ol">
<li>Tags.</li>
<li>Properties.</li>
<li>TODO.</li>
<li>Priority.</li>
<li>Archive and refile.</li>
<li>Schedule.</li>
<li>Deadline.</li>
<li>Timestamp. Or time(range) in headline.</li>
<li>Effort.</li>
<li>Clocking work time.</li>
</ol></li>
<li>Agenda.
<ol class="org-ol">
<li>Agenda files.</li>
<li>Agenda views.</li>
<li>Custom agenda view.</li>
</ol></li>
<li>Capture.</li>
<li>Beorg.</li>
</ol>

<p>
Goal:
</p>
<ol class="org-ol">
<li>Capturing.</li>
<li>Task Planning (what, when).</li>
<li>Time management (appt, what to do, what have done, how long).</li>
<li>Note down.</li>
</ol>

<p>
What's my use-cases from history?
</p>
<ol class="org-ol">
<li>"~/Document/bears/": My plain text notes at work.
<ol class="org-ol">
<li>Daily: Planning/recording what I have done that day.</li>
<li>CallforReport: Planning my week at a coarse granularity.</li>
</ol></li>
<li>OmniFocus.app.
<ol class="org-ol">
<li>Shopping list.</li>
<li>Chores.  E.g. Fix bicycle, do the laundry.</li>
<li>What I want to learn.  E.g. Coursera, interesting papers, kernel
concepts, new language.</li>
<li>What I want to checkout.  E.g. interesting persons and their
blogs, News.</li>
<li>What I want to do.  E.g. Improve my homepage, fix bugs, make a
wheel.</li>
<li>Reading list.</li>
<li>Work project todo/planning.</li>
<li>Assignments.  Call for report, homework, project, TA work.
Deadlines and planning.</li>
<li>My fancy ideas.</li>
<li>Questions to ask other people.</li>
<li>Howto.</li>
</ol></li>
<li>Reminders.app.
<ol class="org-ol">
<li>Errands.  E.g. fetch something for somebody, pick delivered packages, get the laundry.</li>
<li>Appointments.  E.g. dissertation, test drive, appointment/meeting with somebody.</li>
<li>Reminders.  E.g. Take medicine.</li>
</ol></li>
<li>Calendar.app.
<ol class="org-ol">
<li>Courses.</li>
<li>Talks.</li>
<li>Discussions.</li>
<li>Meetings.</li>
<li>Exercises.</li>
<li>Appointments.  E.g. test drive, appointment/meeting with somebody.</li>
<li>Events.</li>
</ol></li>
<li>Notes.app.
<ol class="org-ol">
<li>Quick notes during a talk when no laptop by my side.</li>
<li>Reading list.  But is undergoing being substitued by
Goodreads.com.</li>
<li>Collections.</li>
<li>Temporary buffer at mobile.</li>
</ol></li>
<li>iOS usage.
<ol class="org-ol">
<li>Ask Siri to remind me.</li>
<li>Quick notes.</li>
<li>Appointments.</li>
<li>Shopping list.</li>
<li>Kill time when outside.</li>
</ol></li>
</ol>

<p>
Implementation:
</p>
<ol class="org-ol">
<li>Capturing.  Using Org capture.  Capture ideas into inbox.
Implemented by a top-level sub-tree "Inbox", propertied by
<code>CATEGORY="inbox"</code>.  For quick insertion, add a Capture template
to insert task into "Inbox".  For quick viewing, add a
<code>org-agenda-custom-commands</code> to filter <code>+CATEGORY="inbox"+LEVEL=2</code>.</li>
<li>Task Planning.
<ol class="org-ol">
<li>Use subtree, list for planning.  Use Emacs <i>narrow</i> to reduce distraction.</li>
<li>Use tags for future retrieving.</li>
<li>Mark task as TODO if I am going to do it recently.  Then periodically I will match all TODO items to further schedule them to a specific time and date  (see Time management below).</li>
<li>Add deadline for tasks if necessary.</li>
</ol></li>
<li>Time management.  Using Org agenda view.
<ol class="org-ol">
<li>Appointments goes to "Appointments" with timestamp.  For
example, "Swimming" has a timestamp of
<code>&lt;2019-07-24 Wed 15:00-17:00 +1w&gt;</code>.</li>
<li>What to do.
<ol class="org-ol">
<li>If you want to do something, mark it <i>TODO</i>.</li>
<li><i>Schedule</i> TODO items to a specific day (or time).</li>
<li><i>Clock-in</i> what you are doing.</li>
</ol></li>
<li>Time logging.  Using <i>clock-in</i>, <i>clock-out</i>.</li>
<li>Archiving.  Tasks that done should be archived to keep the org
file neat.  To query upon archived tasks, visit the archive file
and use <i>sparse tree</i>.</li>
</ol></li>
<li>Note down. Add entry to "Misc".</li>
</ol>
</div>
</div>
<div id="outline-container-org46cb243" class="outline-2">
<h2 id="org46cb243"><span class="section-number-2">5</span> One month after migrating to Org-mode</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7180ab5" class="outline-3">
<h3 id="org7180ab5"><span class="section-number-3">5.1</span> Case study: How to see what I have doen last week?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Use agenda week view
</p>
<ol class="org-ol">
<li>with archive file included, so that those archived tasks are shown.</li>
<li>with log included, so that I can see what I've clocked-in/out in detail.</li>
<li>with clock report included, so that I directly see my working hours, and what tasks have I worked on.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc1baffe" class="outline-3">
<h3 id="orgc1baffe"><span class="section-number-3">5.2</span> Issues I met</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Priority inverse in my task execution:  I headed for new, emerging tasks before the completion of my old TODOs.  As a result, old TODOs got accumulated.  This bad workflow hurts the progress of the tasks that I really want to do and increases the pressure when I check my tasks.</li>
<li>GTD Org file bloat and the fragmentation of my Org notes.  Org-mode serves two functionality for me now, 1) note-taking (e.g. research journal) and 2) task management (GTD).  After using Org mode for GTD, I tended to write task execution result, thoughts, further ideas, simple research journaling directly in substrees in the GTD org file.  Then my research notes began scattering several places (in some TODO/DONE subtrees, and in standalone research note Org files.  Either I bother copying them all to standalone project note files or I would have a hard time when searching for previous notes.  Finally I realized that there should be a clear dividing between task&amp;time management and my write-ups.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Oct 22, 2019</p>
<p class="validation"></p>
</div>
</body>
</html>
